{
    "CREATE": "Creates a new table, a view of a table, or other object in the database.",
    "ALTER": "Modifies an existing database object, such as a table.",
    "DROP": "Deletes an entire table, a view of a table, or other objects in the database.",
    "SELECT": "Retrieves certain records from one or more tables.",
    "INSERT": "Inserts new data into a database.",
    "UPDATE": "Modifies records in a database.",
    "DELETE": "Deletes records from a database.",
    "GRANT": "Gives a privilege to a user.",
    "REVOKE": "Takes back a privilege from a user.",
    "COMMIT": "Saves work done in transactions.",
    "ROLLBACK": "Restores the database to the original state since the last COMMIT command in a transaction.",
    "SAVEPOINT": "Sets a point in a transaction to which you can later roll back.",
    "TRUNCATE": "Removes all records from a table, including all spaces allocated for the records.",
    "RENAME": "Renames an existing database object like a table.",
    "AVG()": "Returns the average value of a numeric column.",
    "COUNT()": "Returns the number of rows that matches a specified criterion.",
    "MAX()": "Returns the maximum value of a column.",
    "MIN()": "Returns the minimum value of a column.",
    "SUM()": "Returns the total sum of a numeric column.",
    "UCASE()": "Converts a field to upper case.",
    "LCASE()": "Converts a field to lower case.",
    "ROUND()": "Rounds a numeric field to the number of decimals specified.",
    "LEN()": "Returns the length of a text field.",
    "DISTINCT": "Used with SELECT to retrieve unique values.",
    "IN": "Allows you to specify multiple values in a WHERE clause.",
    "BETWEEN": "Selects values within a given range.",
    "LIKE": "Searches for a specified pattern in a column.",
    "UNION": "Combines the result set of two or more SELECT statements (only distinct values).",
    "UNION ALL": "Same as UNION, but UNION ALL selects all values.",
    "CREATE DATABASE": "Creates a new database.",
    "ALTER DATABASE": "Modifies an existing database.",
    "CREATE INDEX": "Creates an index on a table.",
    "DROP INDEX": "Deletes an index from a table.",
    "AND": "Used within a WHERE clause to include multiple conditions, all of which must be met.",
    "OR": "Used within a WHERE clause to include multiple conditions, any of which can be met.",
    "NOT": "Used within a WHERE clause to negate a condition.",
    "ORDER BY": "Used to sort the result-set in ascending or descending order.",
    "GROUP BY": "Used in conjunction with aggregate functions (like COUNT, MAX, MIN, SUM, AVG) to group the result-set by one or more columns.",
    "HAVING": "Used with the GROUP BY clause to filter group rows that do not satisfy a specified condition.",
    "JOIN": "Used to combine rows from two or more tables based on a related column between them.",
    "LEFT (OUTER) JOIN": "Returns all records from the left table, and the matched records from the right table.",
    "RIGHT (OUTER) JOIN": "Returns all records from the right table, and the matched records from the left table.",
    "FULL (OUTER) JOIN": "Returns all records when there is a match in either the left or the right table.",
    "INNER JOIN": "Returns records that have matching values in both tables.",
    "NULL": "Represents a missing or unknown value. You can use the IS NULL or IS NOT NULL operators in conjunction with NULL.",
    "AS": "Used to rename a column or table with an alias."
}